Tekla Open API Reference for Tekla Structures 2025
IEvents.DrawingInserted Event
 The DrawingInserted event is raised when a drawing has been inserted.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.DrawingInsertedDelegate DrawingInserted
Event DrawingInserted As Events.DrawingInsertedDelegate
Value
Type: Tekla.Structures.Drawing.Events.DrawingInsertedDelegate
See Also
Reference
IEvents Interface
Tekla.Structures.Drawing Namespace